# colo_emojis.py
colo_emojis = {
    "US": "🇺🇸",
    "SJC": "🇺🇸",  # 圣何塞
    "LAX": "🇺🇸",  # 洛杉矶
    "SEA": "🇺🇸",  # 西雅图
    "JFK": "🇺🇸",  # 纽约 - 肯尼迪国际机场
    "ORD": "🇺🇸",  # 芝加哥 - 奥黑尔国际机场
    "US": "🇺🇸",  # 美国

    # 德国
    "FRA": "🇩🇪",  # 法兰克福机场
    "DE": "🇩🇪",  # 德国

    # 英国
    "LHR": "🇬🇧",  # 伦敦
    "UK": "🇬🇧",  # 英国

    # 日本
    "NRT": "🇯🇵",  # 东京成田
    "HND": "🇯🇵",  # 东京羽田
    "JP": "🇯🇵",  # 日本

    # 香港
    "HKG": "🇭🇰",  # 香港国际机场
    "HK": "🇭🇰",  # 香港

    # 韩国
    "ICN": "🇰🇷",  # 仁川国际机场
    "KR": "🇰🇷",  # 韩国

    # 台湾
    "TPE": "🇹🇼",  # 台北桃园机场
    "KHH": "🇹🇼",  # 台湾高雄
    "TW": "🇹🇼",  # 台湾

    # 新加坡
    "SIN": "🇸🇬",   # 樟宜机场
    "SG": "🇸🇬",  # 新加坡

    # 芬兰
    "HEL": "🇫🇮",  # 赫尔辛基
    "FI": "🇫🇮",  # 芬兰

    # 波兰
    "WAW": "🇵🇱",  # 华沙
    "PL": "🇵🇱",  # 波兰

    # CF优选
    "CF优选": "☁️"  # CF优选
}